; domain
(define (domain pacman-72)
  (:requirements :strips :typing)
  (:types position)

  (:predicates
    (at ?pos - position)
    (not_at ?pos - position)          ; complement of at
    (visited ?pos - position)
    (connected ?from ?to - position)
    (hasFood ?pos - position)
    (noFood ?pos - position)          ; complement of hasFood
    (carryingFood) 
  )

  (:action move
    :parameters (?from ?to - position)
    :precondition (and
      (at ?from)
      (not_at ?to)
      (connected ?from ?to)
    )
    :effect (and
      (at ?to)
      (not (at ?from))        ; DELETE: Pacman is no longer at ?from
      (not_at ?from)
      (visited ?to)
      (not (not_at ?to))      ; DELETE: ?to is no longer marked as not_at
    )
  )

  (:action eat
    :parameters (?pos - position)
    :precondition (and
      (at ?pos)
      (hasFood ?pos)
    )
    :effect (and
      (carryingFood)
      (noFood ?pos)
      (not (hasFood ?pos))   ; DELETE: the food is gone
    )
  )
)

; problem
(define (problem pacman-72)
    (:domain pacman-72)
    (:objects
        p00 p01 p02 p03 p04 p05 p06 p07 p10 p11 p12 p13 p14 p15 p16 p17 p20 p21 p22 p23 p24 p25 p26 p27 p30 p31 p32 p33 p34 p35 p36 p37 p40 p41 p42 p43 p44 p45 p46 p47 p50 p51 p52 p53 p54 p55 p56 p57 p60 p61 p62 p63 p64 p65 p66 p67 p70 p71 p72 p73 p74 p75 p76 p77 - position
    )

    (:init
        (not_at p00)
        (not (at p00))
        (not_at p01)
        (not (at p01))
        (not_at p02)
        (not (at p02))
        (at p03)
        (not (not_at p03))
        (not_at p04)
        (not (at p04))
        (not_at p05)
        (not (at p05))
        (not_at p06)
        (not (at p06))
        (not_at p07)
        (not (at p07))
        (not_at p10)
        (not (at p10))
        (not_at p11)
        (not (at p11))
        (not_at p12)
        (not (at p12))
        (not_at p13)
        (not (at p13))
        (not_at p14)
        (not (at p14))
        (not_at p15)
        (not (at p15))
        (not_at p16)
        (not (at p16))
        (not_at p17)
        (not (at p17))
        (not_at p20)
        (not (at p20))
        (not_at p21)
        (not (at p21))
        (not_at p22)
        (not (at p22))
        (not_at p23)
        (not (at p23))
        (not_at p24)
        (not (at p24))
        (not_at p25)
        (not (at p25))
        (not_at p26)
        (not (at p26))
        (not_at p27)
        (not (at p27))
        (not_at p30)
        (not (at p30))
        (not_at p31)
        (not (at p31))
        (not_at p32)
        (not (at p32))
        (not_at p33)
        (not (at p33))
        (not_at p34)
        (not (at p34))
        (not_at p35)
        (not (at p35))
        (not_at p36)
        (not (at p36))
        (not_at p37)
        (not (at p37))
        (not_at p40)
        (not (at p40))
        (not_at p41)
        (not (at p41))
        (not_at p42)
        (not (at p42))
        (not_at p43)
        (not (at p43))
        (not_at p44)
        (not (at p44))
        (not_at p45)
        (not (at p45))
        (not_at p46)
        (not (at p46))
        (not_at p47)
        (not (at p47))
        (not_at p50)
        (not (at p50))
        (not_at p51)
        (not (at p51))
        (not_at p52)
        (not (at p52))
        (not_at p53)
        (not (at p53))
        (not_at p54)
        (not (at p54))
        (not_at p55)
        (not (at p55))
        (not_at p56)
        (not (at p56))
        (not_at p57)
        (not (at p57))
        (not_at p60)
        (not (at p60))
        (not_at p61)
        (not (at p61))
        (not_at p62)
        (not (at p62))
        (not_at p63)
        (not (at p63))
        (not_at p64)
        (not (at p64))
        (not_at p65)
        (not (at p65))
        (not_at p66)
        (not (at p66))
        (not_at p67)
        (not (at p67))
        (not_at p70)
        (not (at p70))
        (not_at p71)
        (not (at p71))
        (not_at p72)
        (not (at p72))
        (not_at p73)
        (not (at p73))
        (not_at p74)
        (not (at p74))
        (not_at p75)
        (not (at p75))
        (not_at p76)
        (not (at p76))
        (not_at p77)
        (not (at p77))
        (hasFood p00)
        (not (noFood p00))
        (noFood p01)
        (not (hasFood p01))
        (noFood p02)
        (not (hasFood p02))
        (hasFood p03)
        (not (noFood p03))
        (noFood p04)
        (not (hasFood p04))
        (noFood p05)
        (not (hasFood p05))
        (noFood p06)
        (not (hasFood p06))
        (noFood p07)
        (not (hasFood p07))
        (hasFood p10)
        (not (noFood p10))
        (noFood p11)
        (not (hasFood p11))
        (noFood p12)
        (not (hasFood p12))
        (noFood p13)
        (not (hasFood p13))
        (noFood p14)
        (not (hasFood p14))
        (noFood p15)
        (not (hasFood p15))
        (noFood p16)
        (not (hasFood p16))
        (noFood p17)
        (not (hasFood p17))
        (noFood p20)
        (not (hasFood p20))
        (noFood p21)
        (not (hasFood p21))
        (noFood p22)
        (not (hasFood p22))
        (noFood p23)
        (not (hasFood p23))
        (noFood p24)
        (not (hasFood p24))
        (noFood p25)
        (not (hasFood p25))
        (noFood p26)
        (not (hasFood p26))
        (noFood p27)
        (not (hasFood p27))
        (noFood p30)
        (not (hasFood p30))
        (noFood p31)
        (not (hasFood p31))
        (noFood p32)
        (not (hasFood p32))
        (hasFood p33)
        (not (noFood p33))
        (noFood p34)
        (not (hasFood p34))
        (noFood p35)
        (not (hasFood p35))
        (hasFood p36)
        (not (noFood p36))
        (noFood p37)
        (not (hasFood p37))
        (noFood p40)
        (not (hasFood p40))
        (noFood p41)
        (not (hasFood p41))
        (noFood p42)
        (not (hasFood p42))
        (noFood p43)
        (not (hasFood p43))
        (noFood p44)
        (not (hasFood p44))
        (noFood p45)
        (not (hasFood p45))
        (noFood p46)
        (not (hasFood p46))
        (noFood p47)
        (not (hasFood p47))
        (hasFood p50)
        (not (noFood p50))
        (noFood p51)
        (not (hasFood p51))
        (noFood p52)
        (not (hasFood p52))
        (noFood p53)
        (not (hasFood p53))
        (noFood p54)
        (not (hasFood p54))
        (noFood p55)
        (not (hasFood p55))
        (noFood p56)
        (not (hasFood p56))
        (noFood p57)
        (not (hasFood p57))
        (noFood p60)
        (not (hasFood p60))
        (noFood p61)
        (not (hasFood p61))
        (noFood p62)
        (not (hasFood p62))
        (noFood p63)
        (not (hasFood p63))
        (noFood p64)
        (not (hasFood p64))
        (noFood p65)
        (not (hasFood p65))
        (noFood p66)
        (not (hasFood p66))
        (noFood p67)
        (not (hasFood p67))
        (noFood p70)
        (not (hasFood p70))
        (hasFood p71)
        (not (noFood p71))
        (noFood p72)
        (not (hasFood p72))
        (noFood p73)
        (not (hasFood p73))
        (noFood p74)
        (not (hasFood p74))
        (noFood p75)
        (not (hasFood p75))
        (noFood p76)
        (not (hasFood p76))
        (noFood p77)
        (not (hasFood p77))
        (connected p00 p10)
        (connected p10 p00)
        (connected p00 p01)
        (connected p01 p00)
        (connected p01 p11)
        (connected p11 p01)
        (connected p01 p02)
        (connected p02 p01)
        (connected p02 p12)
        (connected p12 p02)
        (connected p02 p03)
        (connected p03 p02)
        (connected p03 p13)
        (connected p13 p03)
        (connected p03 p04)
        (connected p04 p03)
        (connected p04 p14)
        (connected p14 p04)
        (connected p04 p05)
        (connected p05 p04)
        (connected p05 p15)
        (connected p15 p05)
        (connected p05 p06)
        (connected p06 p05)
        (connected p06 p16)
        (connected p16 p06)
        (connected p06 p07)
        (connected p07 p06)
        (connected p07 p17)
        (connected p17 p07)
        (connected p10 p20)
        (connected p20 p10)
        (connected p10 p11)
        (connected p11 p10)
        (connected p11 p21)
        (connected p21 p11)
        (connected p11 p12)
        (connected p12 p11)
        (connected p12 p22)
        (connected p22 p12)
        (connected p12 p13)
        (connected p13 p12)
        (connected p13 p23)
        (connected p23 p13)
        (connected p13 p14)
        (connected p14 p13)
        (connected p14 p24)
        (connected p24 p14)
        (connected p14 p15)
        (connected p15 p14)
        (connected p15 p25)
        (connected p25 p15)
        (connected p15 p16)
        (connected p16 p15)
        (connected p16 p26)
        (connected p26 p16)
        (connected p16 p17)
        (connected p17 p16)
        (connected p17 p27)
        (connected p27 p17)
        (connected p20 p30)
        (connected p30 p20)
        (connected p20 p21)
        (connected p21 p20)
        (connected p21 p31)
        (connected p31 p21)
        (connected p21 p22)
        (connected p22 p21)
        (connected p22 p32)
        (connected p32 p22)
        (connected p22 p23)
        (connected p23 p22)
        (connected p23 p33)
        (connected p33 p23)
        (connected p23 p24)
        (connected p24 p23)
        (connected p24 p34)
        (connected p34 p24)
        (connected p24 p25)
        (connected p25 p24)
        (connected p25 p35)
        (connected p35 p25)
        (connected p25 p26)
        (connected p26 p25)
        (connected p26 p36)
        (connected p36 p26)
        (connected p26 p27)
        (connected p27 p26)
        (connected p27 p37)
        (connected p37 p27)
        (connected p30 p40)
        (connected p40 p30)
        (connected p30 p31)
        (connected p31 p30)
        (connected p31 p41)
        (connected p41 p31)
        (connected p31 p32)
        (connected p32 p31)
        (connected p32 p42)
        (connected p42 p32)
        (connected p32 p33)
        (connected p33 p32)
        (connected p33 p43)
        (connected p43 p33)
        (connected p33 p34)
        (connected p34 p33)
        (connected p34 p44)
        (connected p44 p34)
        (connected p34 p35)
        (connected p35 p34)
        (connected p35 p45)
        (connected p45 p35)
        (connected p35 p36)
        (connected p36 p35)
        (connected p36 p46)
        (connected p46 p36)
        (connected p36 p37)
        (connected p37 p36)
        (connected p37 p47)
        (connected p47 p37)
        (connected p40 p50)
        (connected p50 p40)
        (connected p40 p41)
        (connected p41 p40)
        (connected p41 p51)
        (connected p51 p41)
        (connected p41 p42)
        (connected p42 p41)
        (connected p42 p52)
        (connected p52 p42)
        (connected p42 p43)
        (connected p43 p42)
        (connected p43 p53)
        (connected p53 p43)
        (connected p43 p44)
        (connected p44 p43)
        (connected p44 p54)
        (connected p54 p44)
        (connected p44 p45)
        (connected p45 p44)
        (connected p45 p55)
        (connected p55 p45)
        (connected p45 p46)
        (connected p46 p45)
        (connected p46 p56)
        (connected p56 p46)
        (connected p46 p47)
        (connected p47 p46)
        (connected p47 p57)
        (connected p57 p47)
        (connected p50 p60)
        (connected p60 p50)
        (connected p50 p51)
        (connected p51 p50)
        (connected p51 p61)
        (connected p61 p51)
        (connected p51 p52)
        (connected p52 p51)
        (connected p52 p62)
        (connected p62 p52)
        (connected p52 p53)
        (connected p53 p52)
        (connected p53 p63)
        (connected p63 p53)
        (connected p53 p54)
        (connected p54 p53)
        (connected p54 p64)
        (connected p64 p54)
        (connected p54 p55)
        (connected p55 p54)
        (connected p55 p65)
        (connected p65 p55)
        (connected p55 p56)
        (connected p56 p55)
        (connected p56 p66)
        (connected p66 p56)
        (connected p56 p57)
        (connected p57 p56)
        (connected p57 p67)
        (connected p67 p57)
        (connected p60 p70)
        (connected p70 p60)
        (connected p60 p61)
        (connected p61 p60)
        (connected p61 p71)
        (connected p71 p61)
        (connected p61 p62)
        (connected p62 p61)
        (connected p62 p72)
        (connected p72 p62)
        (connected p62 p63)
        (connected p63 p62)
        (connected p63 p73)
        (connected p73 p63)
        (connected p63 p64)
        (connected p64 p63)
        (connected p64 p74)
        (connected p74 p64)
        (connected p64 p65)
        (connected p65 p64)
        (connected p65 p75)
        (connected p75 p65)
        (connected p65 p66)
        (connected p66 p65)
        (connected p66 p76)
        (connected p76 p66)
        (connected p66 p67)
        (connected p67 p66)
        (connected p67 p77)
        (connected p77 p67)
        (connected p70 p71)
        (connected p71 p70)
        (connected p71 p72)
        (connected p72 p71)
        (connected p72 p73)
        (connected p73 p72)
        (connected p73 p74)
        (connected p74 p73)
        (connected p74 p75)
        (connected p75 p74)
        (connected p75 p76)
        (connected p76 p75)
        (connected p76 p77)
        (connected p77 p76)
    )

    (:goal (and
        (noFood p03)
        (noFood p36)
        (noFood p50)
        (noFood p33)
        (noFood p10)
        (noFood p00)
        (noFood p71)
    ))
)

; plan
1. (eat p03)
   deleted: (hasfood p03)
   added: (carryingfood) (nofood p03)
   goals met: 1 of 7
2. (move p03 p02)
   deleted: (at p03) (not_at p02)
   added: (at p02) (not_at p03) (visited p02)
   goals met: 1 of 7
3. (move p02 p01)
   deleted: (at p02) (not_at p01)
   added: (at p01) (not_at p02) (visited p01)
   goals met: 1 of 7
4. (move p01 p00)
   deleted: (at p01) (not_at p00)
   added: (at p00) (not_at p01) (visited p00)
   goals met: 1 of 7
5. (eat p00)
   deleted: (hasfood p00)
   added: (nofood p00)
   goals met: 2 of 7
6. (move p00 p10)
   deleted: (at p00) (not_at p10)
   added: (at p10) (not_at p00) (visited p10)
   goals met: 2 of 7
7. (eat p10)
   deleted: (hasfood p10)
   added: (nofood p10)
   goals met: 3 of 7
8. (move p10 p20)
   deleted: (at p10) (not_at p20)
   added: (at p20) (not_at p10) (visited p20)
   goals met: 3 of 7
9. (move p20 p30)
   deleted: (at p20) (not_at p30)
   added: (at p30) (not_at p20) (visited p30)
   goals met: 3 of 7
10. (move p30 p40)
   deleted: (at p30) (not_at p40)
   added: (at p40) (not_at p30) (visited p40)
   goals met: 3 of 7
11. (move p40 p50)
   deleted: (at p40) (not_at p50)
   added: (at p50) (not_at p40) (visited p50)
   goals met: 3 of 7
12. (eat p50)
   deleted: (hasfood p50)
   added: (nofood p50)
   goals met: 4 of 7
13. (move p50 p51)
   deleted: (at p50) (not_at p51)
   added: (at p51) (not_at p50) (visited p51)
   goals met: 4 of 7
14. (move p51 p61)
   deleted: (at p51) (not_at p61)
   added: (at p61) (not_at p51) (visited p61)
   goals met: 4 of 7
15. (move p61 p71)
   deleted: (at p61) (not_at p71)
   added: (at p71) (not_at p61) (visited p71)
   goals met: 4 of 7
16. (eat p71)
   deleted: (hasfood p71)
   added: (nofood p71)
   goals met: 5 of 7
17. (move p71 p61)
   deleted: (at p71) (not_at p61)
   added: (at p61) (not_at p71)
   goals met: 5 of 7
18. (move p61 p62)
   deleted: (at p61) (not_at p62)
   added: (at p62) (not_at p61) (visited p62)
   goals met: 5 of 7
19. (move p62 p52)
   deleted: (at p62) (not_at p52)
   added: (at p52) (not_at p62) (visited p52)
   goals met: 5 of 7
20. (move p52 p53)
   deleted: (at p52) (not_at p53)
   added: (at p53) (not_at p52) (visited p53)
   goals met: 5 of 7
21. (move p53 p43)
   deleted: (at p53) (not_at p43)
   added: (at p43) (not_at p53) (visited p43)
   goals met: 5 of 7
22. (move p43 p33)
   deleted: (at p43) (not_at p33)
   added: (at p33) (not_at p43) (visited p33)
   goals met: 5 of 7
23. (eat p33)
   deleted: (hasfood p33)
   added: (nofood p33)
   goals met: 6 of 7
24. (move p33 p34)
   deleted: (at p33) (not_at p34)
   added: (at p34) (not_at p33) (visited p34)
   goals met: 6 of 7
25. (move p34 p35)
   deleted: (at p34) (not_at p35)
   added: (at p35) (not_at p34) (visited p35)
   goals met: 6 of 7
26. (move p35 p36)
   deleted: (at p35) (not_at p36)
   added: (at p36) (not_at p35) (visited p36)
   goals met: 6 of 7
27. (eat p36)
   deleted: (hasfood p36)
   added: (nofood p36)
   goals met: 7 of 7
